{
  "backend/main.mo": "Main Motoko actor implementing the Farmer eKYC backend with agent management, farmer application submission, OTP-based manager authentication, and access control using a mixin authorization pattern.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: restoring the earthy green and warm amber color palette across all frontend pages, and updating CSS/Tailwind config with vivid OKLCH/HSL color tokens.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose and key implementation details, serving as a reference for the frontend codebase structure.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom property color tokens for light and dark modes, including primary, accent, destructive, and chart colors.",
  "frontend/index.html": "Minimal HTML shell for the React app, mounting the root div and loading the main TypeScript entry point as an ES module.",
  "frontend/src/App.tsx": "Main application router using TanStack Router, defining all routes for agent and manager flows with session-based authentication guards that redirect unauthenticated users to the appropriate login pages.",
  "frontend/src/components/Layout.tsx": "Shared authenticated page layout featuring a sticky earthy-green header with an amber logo icon, user role badge, logout button, optional page title bar, and a branded footer.",
  "frontend/src/components/StatusBadge.tsx": "Small presentational component rendering a colored pill badge for application/agent statuses (pending, approved, rejected) using amber, emerald, and red Tailwind styles.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) access, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider component, exposing login/logout functions, identity state, and login status via a React context hook.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating agent and farmer eKYC application data against the ICP backend actor, including queries for listing agents/applications and mutations for registration, login, and status updates.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines a custom earthy green and warm amber design token palette for both light and dark modes using CSS custom properties.",
  "frontend/src/lib/auth.ts": "Session management utilities for agents and managers, providing functions to save, retrieve, and clear sessions from sessionStorage, plus simple password hashing and agent ID generation helpers.",
  "frontend/src/lib/utils.ts": "Utility functions including a Tailwind class merger (`cn`), and date/datetime formatters that handle both bigint nanosecond timestamps and numeric millisecond timestamps.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with React Query's QueryClientProvider and the InternetIdentityProvider.",
  "frontend/src/pages/AcknowledgmentScreen.tsx": "Page displayed after a farmer eKYC application is submitted, showing the acknowledgment number with copy functionality and navigation buttons to submit a new application or check status.",
  "frontend/src/pages/AgentApproval.tsx": "Manager page for reviewing and approving or rejecting registered agents, featuring a searchable list of agents with their current status and action buttons.",
  "frontend/src/pages/AgentDashboard.tsx": "Renders the agent dashboard with a welcome banner showing the agent's session info and quick-action cards for submitting eKYC applications and checking application status.",
  "frontend/src/pages/AgentLogin.tsx": "Provides a two-tab login form for agents to authenticate via Agent ID + OTP or phone + password, saving the session and redirecting to the dashboard on success.",
  "frontend/src/pages/AgentSignup.tsx": "Handles new agent self-registration by collecting name, contact, and password, generating an agent ID, hashing the password, and displaying the generated ID for the agent to save.",
  "frontend/src/pages/CheckApplicationStatus.tsx": "Allows agents to look up a farmer eKYC application by its 14-digit acknowledgment number and displays the application details along with its approval status badge.",
  "frontend/src/pages/CreateAgentAccount.tsx": "Lets managers create pre-approved agent accounts by entering agent details, then displays the generated Agent ID with a copy button for sharing with the new agent.",
  "frontend/src/pages/FarmerApplicationApproval.tsx": "Manager page for reviewing and approving/rejecting farmer eKYC applications, with search filtering and expandable application details.",
  "frontend/src/pages/ManagerDashboard.tsx": "Manager dashboard displaying overview stats (agents, applications, pending counts) and navigation cards to agent approval, application approval, and agent creation pages.",
  "frontend/src/pages/ManagerLogin.tsx": "Two-step manager login page that requests an OTP via email and verifies it to establish a manager session.",
  "frontend/src/pages/SubmitFarmerEKYC.tsx": "Agent-facing form page for submitting a new farmer eKYC application with fields for personal and document details, redirecting to an acknowledgment page on success.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routes, with sessionStorage persistence helpers and hash cleanup.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with CSS-variable-based colors, custom fonts (Inter/Poppins), border radii, box shadows, and animation/typography plugins.",
  "project_state.json": "Tracks the overall project state (version 23) for the Farmer EKYC app, including architecture notes, known issues, and a list of all existing and planned features with their IDs, titles, requirement references, and versions."
}